zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcr.h
#define FCR_INTENCLR_SERR_Pos                 _UINT32_(0)                                          /* (FCR_INTENCLR) Flash SEC Interrupt Clear Enable Position */
#define FCR_INTENCLR_SERR_Msk                 (_UINT32_(0x1) << FCR_INTENCLR_SERR_Pos)             /* (FCR_INTENCLR) Flash SEC Interrupt Clear Enable Mask */
#define FCR_INTENCLR_SERR(value)              (FCR_INTENCLR_SERR_Msk & (_UINT32_(value) << FCR_INTENCLR_SERR_Pos)) /* Assignment of value for SERR in the FCR_INTENCLR register */
#define   FCR_INTENCLR_SERR_0_Val             _UINT32_(0x0)                                        /* (FCR_INTENCLR) Interrupt Disabled  */
#define   FCR_INTENCLR_SERR_1_Val             _UINT32_(0x1)                                        /* (FCR_INTENCLR) Interrupt Enabled  */
#define FCR_INTENCLR_SERR_0                   (FCR_INTENCLR_SERR_0_Val << FCR_INTENCLR_SERR_Pos)   /* (FCR_INTENCLR) Interrupt Disabled Position */
#define FCR_INTENCLR_SERR_1                   (FCR_INTENCLR_SERR_1_Val << FCR_INTENCLR_SERR_Pos)   /* (FCR_INTENCLR) Interrupt Enabled Position */
#define FCR_INTENCLR_CRCDONE_Pos              _UINT32_(8)                                          /* (FCR_INTENCLR) CRC Calculation Done Clear Enable Position */
#define FCR_INTENCLR_CRCDONE_Msk              (_UINT32_(0x1) << FCR_INTENCLR_CRCDONE_Pos)          /* (FCR_INTENCLR) CRC Calculation Done Clear Enable Mask */
#define FCR_INTENCLR_CRCDONE(value)           (FCR_INTENCLR_CRCDONE_Msk & (_UINT32_(value) << FCR_INTENCLR_CRCDONE_Pos)) /* Assignment of value for CRCDONE in the FCR_INTENCLR register */
#define   FCR_INTENCLR_CRCDONE_0_Val          _UINT32_(0x0)                                        /* (FCR_INTENCLR) Interrupt Disabled  */
#define   FCR_INTENCLR_CRCDONE_1_Val          _UINT32_(0x1)                                        /* (FCR_INTENCLR) Interrupt Enabled  */
#define FCR_INTENCLR_CRCDONE_0                (FCR_INTENCLR_CRCDONE_0_Val << FCR_INTENCLR_CRCDONE_Pos) /* (FCR_INTENCLR) Interrupt Disabled Position */
#define FCR_INTENCLR_CRCDONE_1                (FCR_INTENCLR_CRCDONE_1_Val << FCR_INTENCLR_CRCDONE_Pos) /* (FCR_INTENCLR) Interrupt Enabled Position */
#define FCR_INTENCLR_CRCERR_Pos               _UINT32_(9)                                          /* (FCR_INTENCLR) CRC Error Clear Enable Position */
#define FCR_INTENCLR_CRCERR_Msk               (_UINT32_(0x1) << FCR_INTENCLR_CRCERR_Pos)           /* (FCR_INTENCLR) CRC Error Clear Enable Mask */
#define FCR_INTENCLR_CRCERR(value)            (FCR_INTENCLR_CRCERR_Msk & (_UINT32_(value) << FCR_INTENCLR_CRCERR_Pos)) /* Assignment of value for CRCERR in the FCR_INTENCLR register */
#define   FCR_INTENCLR_CRCERR_0_Val           _UINT32_(0x0)                                        /* (FCR_INTENCLR) Interrupt Disabled  */
#define   FCR_INTENCLR_CRCERR_1_Val           _UINT32_(0x1)                                        /* (FCR_INTENCLR) Interrupt Enabled  */
#define FCR_INTENCLR_CRCERR_0                 (FCR_INTENCLR_CRCERR_0_Val << FCR_INTENCLR_CRCERR_Pos) /* (FCR_INTENCLR) Interrupt Disabled Position */
#define FCR_INTENCLR_CRCERR_1                 (FCR_INTENCLR_CRCERR_1_Val << FCR_INTENCLR_CRCERR_Pos) /* (FCR_INTENCLR) Interrupt Enabled Position */
#define FCR_INTENCLR_FLTCAP_Pos               _UINT32_(16)                                         /* (FCR_INTENCLR) ECC Fault Capture Clear Enable Position */
#define FCR_INTENCLR_FLTCAP_Msk               (_UINT32_(0x1) << FCR_INTENCLR_FLTCAP_Pos)           /* (FCR_INTENCLR) ECC Fault Capture Clear Enable Mask */
#define FCR_INTENCLR_FLTCAP(value)            (FCR_INTENCLR_FLTCAP_Msk & (_UINT32_(value) << FCR_INTENCLR_FLTCAP_Pos)) /* Assignment of value for FLTCAP in the FCR_INTENCLR register */
#define   FCR_INTENCLR_FLTCAP_0_Val           _UINT32_(0x0)                                        /* (FCR_INTENCLR) Interrupt Disabled  */
#define   FCR_INTENCLR_FLTCAP_1_Val           _UINT32_(0x1)                                        /* (FCR_INTENCLR) Interrupt Enabled  */
#define FCR_INTENCLR_FLTCAP_0                 (FCR_INTENCLR_FLTCAP_0_Val << FCR_INTENCLR_FLTCAP_Pos) /* (FCR_INTENCLR) Interrupt Disabled Position */
#define FCR_INTENCLR_FLTCAP_1                 (FCR_INTENCLR_FLTCAP_1_Val << FCR_INTENCLR_FLTCAP_Pos) /* (FCR_INTENCLR) Interrupt Enabled Position */
#define FCR_INTENCLR_Msk                      _UINT32_(0x00010301)                                 /* (FCR_INTENCLR) Register Mask  */


/* -------- FCR_INTENSET : (FCR Offset: 0x0C) (R/W 32) Interrupt Enable SET REGISTER -------- */
#define FCR_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (FCR_INTENSET) Interrupt Enable SET REGISTER  Reset Value */

#define FCR_INTENSET_SERR_Pos                 _UINT32_(0)                                          /* (FCR_INTENSET) Flash SEC Interrupt Set Enable Position */
#define FCR_INTENSET_SERR_Msk                 (_UINT32_(0x1) << FCR_INTENSET_SERR_Pos)             /* (FCR_INTENSET) Flash SEC Interrupt Set Enable Mask */
#define FCR_INTENSET_SERR(value)              (FCR_INTENSET_SERR_Msk & (_UINT32_(value) << FCR_INTENSET_SERR_Pos)) /* Assignment of value for SERR in the FCR_INTENSET register */
#define   FCR_INTENSET_SERR_0_Val             _UINT32_(0x0)                                        /* (FCR_INTENSET) Interrupt Disabled  */
#define   FCR_INTENSET_SERR_1_Val             _UINT32_(0x1)                                        /* (FCR_INTENSET) Interrupt Enabled  */
#define FCR_INTENSET_SERR_0                   (FCR_INTENSET_SERR_0_Val << FCR_INTENSET_SERR_Pos)   /* (FCR_INTENSET) Interrupt Disabled Position */
#define FCR_INTENSET_SERR_1                   (FCR_INTENSET_SERR_1_Val << FCR_INTENSET_SERR_Pos)   /* (FCR_INTENSET) Interrupt Enabled Position */
#define FCR_INTENSET_CRCDONE_Pos              _UINT32_(8)                                          /* (FCR_INTENSET) CRC Calculation Done Set Enable Position */
#define FCR_INTENSET_CRCDONE_Msk              (_UINT32_(0x1) << FCR_INTENSET_CRCDONE_Pos)          /* (FCR_INTENSET) CRC Calculation Done Set Enable Mask */
#define FCR_INTENSET_CRCDONE(value)           (FCR_INTENSET_CRCDONE_Msk & (_UINT32_(value) << FCR_INTENSET_CRCDONE_Pos)) /* Assignment of value for CRCDONE in the FCR_INTENSET register */
#define   FCR_INTENSET_CRCDONE_0_Val          _UINT32_(0x0)                                        /* (FCR_INTENSET) Interrupt Disabled  */
#define   FCR_INTENSET_CRCDONE_1_Val          _UINT32_(0x1)                                        /* (FCR_INTENSET) Interrupt Enabled  */
#define FCR_INTENSET_CRCDONE_0                (FCR_INTENSET_CRCDONE_0_Val << FCR_INTENSET_CRCDONE_Pos) /* (FCR_INTENSET) Interrupt Disabled Position */
#define FCR_INTENSET_CRCDONE_1                (FCR_INTENSET_CRCDONE_1_Val << FCR_INTENSET_CRCDONE_Pos) /* (FCR_INTENSET) Interrupt Enabled Position */
#define FCR_INTENSET_CRCERR_Pos               _UINT32_(9)                                          /* (FCR_INTENSET) CRC Error Set Enable Position */
#define FCR_INTENSET_CRCERR_Msk               (_UINT32_(0x1) << FCR_INTENSET_CRCERR_Pos)           /* (FCR_INTENSET) CRC Error Set Enable Mask */
#define FCR_INTENSET_CRCERR(value)            (FCR_INTENSET_CRCERR_Msk & (_UINT32_(value) << FCR_INTENSET_CRCERR_Pos)) /* Assignment of value for CRCERR in the FCR_INTENSET register */
#define   FCR_INTENSET_CRCERR_0_Val           _UINT32_(0x0)                                        /* (FCR_INTENSET) Interrupt Disabled  */
#define   FCR_INTENSET_CRCERR_1_Val           _UINT32_(0x1)                                        /* (FCR_INTENSET) Interrupt Enabled  */
#define FCR_INTENSET_CRCERR_0                 (FCR_INTENSET_CRCERR_0_Val << FCR_INTENSET_CRCERR_Pos) /* (FCR_INTENSET) Interrupt Disabled Position */
#define FCR_INTENSET_CRCERR_1                 (FCR_INTENSET_CRCERR_1_Val << FCR_INTENSET_CRCERR_Pos) /* (FCR_INTENSET) Interrupt Enabled Position */
#define FCR_INTENSET_FLTCAP_Pos               _UINT32_(16)                                         /* (FCR_INTENSET) ECC Fault Capture Set Enable Position */
#define FCR_INTENSET_FLTCAP_Msk               (_UINT32_(0x1) << FCR_INTENSET_FLTCAP_Pos)           /* (FCR_INTENSET) ECC Fault Capture Set Enable Mask */
#define FCR_INTENSET_FLTCAP(value)            (FCR_INTENSET_FLTCAP_Msk & (_UINT32_(value) << FCR_INTENSET_FLTCAP_Pos)) /* Assignment of value for FLTCAP in the FCR_INTENSET register */
#define   FCR_INTENSET_FLTCAP_0_Val           _UINT32_(0x0)                                        /* (FCR_INTENSET) Interrupt Disabled  */
#define   FCR_INTENSET_FLTCAP_1_Val           _UINT32_(0x1)                                        /* (FCR_INTENSET) Interrupt Enabled  */
#define FCR_INTENSET_FLTCAP_0                 (FCR_INTENSET_FLTCAP_0_Val << FCR_INTENSET_FLTCAP_Pos) /* (FCR_INTENSET) Interrupt Disabled Position */
#define FCR_INTENSET_FLTCAP_1                 (FCR_INTENSET_FLTCAP_1_Val << FCR_INTENSET_FLTCAP_Pos) /* (FCR_INTENSET) Interrupt Enabled Position */
#define FCR_INTENSET_Msk                      _UINT32_(0x00010301)                                 /* (FCR_INTENSET) Register Mask  */


