zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcr.h
/* -------- FCR_INTFLAG : (FCR Offset: 0x10) (R/W 32) Interrupt Flag REGISTER -------- */
#define FCR_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_INTFLAG) Interrupt Flag REGISTER  Reset Value */

#define FCR_INTFLAG_SERR_Pos                  _UINT32_(0)                                          /* (FCR_INTFLAG) Flash SEC Interrupt Flag Position */
#define FCR_INTFLAG_SERR_Msk                  (_UINT32_(0x1) << FCR_INTFLAG_SERR_Pos)              /* (FCR_INTFLAG) Flash SEC Interrupt Flag Mask */
#define FCR_INTFLAG_SERR(value)               (FCR_INTFLAG_SERR_Msk & (_UINT32_(value) << FCR_INTFLAG_SERR_Pos)) /* Assignment of value for SERR in the FCR_INTFLAG register */
#define   FCR_INTFLAG_SERR_0_Val              _UINT32_(0x0)                                        /* (FCR_INTFLAG) No Interrupt Pending  */
#define   FCR_INTFLAG_SERR_1_Val              _UINT32_(0x1)                                        /* (FCR_INTFLAG) SECCNT Count reached  */
#define FCR_INTFLAG_SERR_0                    (FCR_INTFLAG_SERR_0_Val << FCR_INTFLAG_SERR_Pos)     /* (FCR_INTFLAG) No Interrupt Pending Position */
#define FCR_INTFLAG_SERR_1                    (FCR_INTFLAG_SERR_1_Val << FCR_INTFLAG_SERR_Pos)     /* (FCR_INTFLAG) SECCNT Count reached Position */
#define FCR_INTFLAG_CRCDONE_Pos               _UINT32_(8)                                          /* (FCR_INTFLAG) CRC Calculation Done Flag Position */
#define FCR_INTFLAG_CRCDONE_Msk               (_UINT32_(0x1) << FCR_INTFLAG_CRCDONE_Pos)           /* (FCR_INTFLAG) CRC Calculation Done Flag Mask */
#define FCR_INTFLAG_CRCDONE(value)            (FCR_INTFLAG_CRCDONE_Msk & (_UINT32_(value) << FCR_INTFLAG_CRCDONE_Pos)) /* Assignment of value for CRCDONE in the FCR_INTFLAG register */
#define   FCR_INTFLAG_CRCDONE_0_Val           _UINT32_(0x0)                                        /* (FCR_INTFLAG) No Interrupt Pending  */
#define   FCR_INTFLAG_CRCDONE_1_Val           _UINT32_(0x1)                                        /* (FCR_INTFLAG) Calculation Done  */
#define FCR_INTFLAG_CRCDONE_0                 (FCR_INTFLAG_CRCDONE_0_Val << FCR_INTFLAG_CRCDONE_Pos) /* (FCR_INTFLAG) No Interrupt Pending Position */
#define FCR_INTFLAG_CRCDONE_1                 (FCR_INTFLAG_CRCDONE_1_Val << FCR_INTFLAG_CRCDONE_Pos) /* (FCR_INTFLAG) Calculation Done Position */
#define FCR_INTFLAG_CRCERR_Pos                _UINT32_(9)                                          /* (FCR_INTFLAG) CRC Error Flag Position */
#define FCR_INTFLAG_CRCERR_Msk                (_UINT32_(0x1) << FCR_INTFLAG_CRCERR_Pos)            /* (FCR_INTFLAG) CRC Error Flag Mask */
#define FCR_INTFLAG_CRCERR(value)             (FCR_INTFLAG_CRCERR_Msk & (_UINT32_(value) << FCR_INTFLAG_CRCERR_Pos)) /* Assignment of value for CRCERR in the FCR_INTFLAG register */
#define   FCR_INTFLAG_CRCERR_0_Val            _UINT32_(0x0)                                        /* (FCR_INTFLAG) No Interrupt Pending  */
#define   FCR_INTFLAG_CRCERR_1_Val            _UINT32_(0x1)                                        /* (FCR_INTFLAG) CRCACC Is Not Equal to the XOR of CRCSUM and CRCFXOR  */
#define FCR_INTFLAG_CRCERR_0                  (FCR_INTFLAG_CRCERR_0_Val << FCR_INTFLAG_CRCERR_Pos) /* (FCR_INTFLAG) No Interrupt Pending Position */
#define FCR_INTFLAG_CRCERR_1                  (FCR_INTFLAG_CRCERR_1_Val << FCR_INTFLAG_CRCERR_Pos) /* (FCR_INTFLAG) CRCACC Is Not Equal to the XOR of CRCSUM and CRCFXOR Position */
#define FCR_INTFLAG_FLTCAP_Pos                _UINT32_(16)                                         /* (FCR_INTFLAG) ECC Fault Capture Flag Position */
#define FCR_INTFLAG_FLTCAP_Msk                (_UINT32_(0x1) << FCR_INTFLAG_FLTCAP_Pos)            /* (FCR_INTFLAG) ECC Fault Capture Flag Mask */
#define FCR_INTFLAG_FLTCAP(value)             (FCR_INTFLAG_FLTCAP_Msk & (_UINT32_(value) << FCR_INTFLAG_FLTCAP_Pos)) /* Assignment of value for FLTCAP in the FCR_INTFLAG register */
#define   FCR_INTFLAG_FLTCAP_0_Val            _UINT32_(0x0)                                        /* (FCR_INTFLAG) No Interrupt Pending  */
#define   FCR_INTFLAG_FLTCAP_1_Val            _UINT32_(0x1)                                        /* (FCR_INTFLAG) An ECC Fault Capture, related to FLTMD[], occurred  */
#define FCR_INTFLAG_FLTCAP_0                  (FCR_INTFLAG_FLTCAP_0_Val << FCR_INTFLAG_FLTCAP_Pos) /* (FCR_INTFLAG) No Interrupt Pending Position */
#define FCR_INTFLAG_FLTCAP_1                  (FCR_INTFLAG_FLTCAP_1_Val << FCR_INTFLAG_FLTCAP_Pos) /* (FCR_INTFLAG) An ECC Fault Capture, related to FLTMD[], occurred Position */
#define FCR_INTFLAG_Msk                       _UINT32_(0x00010301)                                 /* (FCR_INTFLAG) Register Mask  */


/* -------- FCR_INTFLAGSET : (FCR Offset: 0x14) (R/W 32) Interrupt Flag Set REGISTER -------- */
#define FCR_INTFLAGSET_RESETVALUE             _UINT32_(0x00)                                       /*  (FCR_INTFLAGSET) Interrupt Flag Set REGISTER  Reset Value */

#define FCR_INTFLAGSET_SERR_Pos               _UINT32_(0)                                          /* (FCR_INTFLAGSET) Flash SEC Interrupt Flag Position */
#define FCR_INTFLAGSET_SERR_Msk               (_UINT32_(0x1) << FCR_INTFLAGSET_SERR_Pos)           /* (FCR_INTFLAGSET) Flash SEC Interrupt Flag Mask */
#define FCR_INTFLAGSET_SERR(value)            (FCR_INTFLAGSET_SERR_Msk & (_UINT32_(value) << FCR_INTFLAGSET_SERR_Pos)) /* Assignment of value for SERR in the FCR_INTFLAGSET register */
#define   FCR_INTFLAGSET_SERR_0_Val           _UINT32_(0x0)                                        /* (FCR_INTFLAGSET) No Interrupt Pending  */
#define   FCR_INTFLAGSET_SERR_1_Val           _UINT32_(0x1)                                        /* (FCR_INTFLAGSET) SECCNT Count reached  */
#define FCR_INTFLAGSET_SERR_0                 (FCR_INTFLAGSET_SERR_0_Val << FCR_INTFLAGSET_SERR_Pos) /* (FCR_INTFLAGSET) No Interrupt Pending Position */
#define FCR_INTFLAGSET_SERR_1                 (FCR_INTFLAGSET_SERR_1_Val << FCR_INTFLAGSET_SERR_Pos) /* (FCR_INTFLAGSET) SECCNT Count reached Position */
#define FCR_INTFLAGSET_CRCDONE_Pos            _UINT32_(8)                                          /* (FCR_INTFLAGSET) CRC Calculation Done Flag Position */
#define FCR_INTFLAGSET_CRCDONE_Msk            (_UINT32_(0x1) << FCR_INTFLAGSET_CRCDONE_Pos)        /* (FCR_INTFLAGSET) CRC Calculation Done Flag Mask */
#define FCR_INTFLAGSET_CRCDONE(value)         (FCR_INTFLAGSET_CRCDONE_Msk & (_UINT32_(value) << FCR_INTFLAGSET_CRCDONE_Pos)) /* Assignment of value for CRCDONE in the FCR_INTFLAGSET register */
#define   FCR_INTFLAGSET_CRCDONE_0_Val        _UINT32_(0x0)                                        /* (FCR_INTFLAGSET) No effect  */
#define   FCR_INTFLAGSET_CRCDONE_1_Val        _UINT32_(0x1)                                        /* (FCR_INTFLAGSET) Set Interrupt Pending  */
#define FCR_INTFLAGSET_CRCDONE_0              (FCR_INTFLAGSET_CRCDONE_0_Val << FCR_INTFLAGSET_CRCDONE_Pos) /* (FCR_INTFLAGSET) No effect Position */
#define FCR_INTFLAGSET_CRCDONE_1              (FCR_INTFLAGSET_CRCDONE_1_Val << FCR_INTFLAGSET_CRCDONE_Pos) /* (FCR_INTFLAGSET) Set Interrupt Pending Position */
#define FCR_INTFLAGSET_CRCERR_Pos             _UINT32_(9)                                          /* (FCR_INTFLAGSET) CRC Error Flag Position */
#define FCR_INTFLAGSET_CRCERR_Msk             (_UINT32_(0x1) << FCR_INTFLAGSET_CRCERR_Pos)         /* (FCR_INTFLAGSET) CRC Error Flag Mask */
#define FCR_INTFLAGSET_CRCERR(value)          (FCR_INTFLAGSET_CRCERR_Msk & (_UINT32_(value) << FCR_INTFLAGSET_CRCERR_Pos)) /* Assignment of value for CRCERR in the FCR_INTFLAGSET register */
#define   FCR_INTFLAGSET_CRCERR_0_Val         _UINT32_(0x0)                                        /* (FCR_INTFLAGSET) No effect  */
#define   FCR_INTFLAGSET_CRCERR_1_Val         _UINT32_(0x1)                                        /* (FCR_INTFLAGSET) Set Interrupt Pending  */
#define FCR_INTFLAGSET_CRCERR_0               (FCR_INTFLAGSET_CRCERR_0_Val << FCR_INTFLAGSET_CRCERR_Pos) /* (FCR_INTFLAGSET) No effect Position */
#define FCR_INTFLAGSET_CRCERR_1               (FCR_INTFLAGSET_CRCERR_1_Val << FCR_INTFLAGSET_CRCERR_Pos) /* (FCR_INTFLAGSET) Set Interrupt Pending Position */
#define FCR_INTFLAGSET_FLTCAP_Pos             _UINT32_(16)                                         /* (FCR_INTFLAGSET) ECC Fault Capture Flag Position */
#define FCR_INTFLAGSET_FLTCAP_Msk             (_UINT32_(0x1) << FCR_INTFLAGSET_FLTCAP_Pos)         /* (FCR_INTFLAGSET) ECC Fault Capture Flag Mask */
#define FCR_INTFLAGSET_FLTCAP(value)          (FCR_INTFLAGSET_FLTCAP_Msk & (_UINT32_(value) << FCR_INTFLAGSET_FLTCAP_Pos)) /* Assignment of value for FLTCAP in the FCR_INTFLAGSET register */
#define   FCR_INTFLAGSET_FLTCAP_0_Val         _UINT32_(0x0)                                        /* (FCR_INTFLAGSET) No effect  */
#define   FCR_INTFLAGSET_FLTCAP_1_Val         _UINT32_(0x1)                                        /* (FCR_INTFLAGSET) Set Interrupt Pending  */
#define FCR_INTFLAGSET_FLTCAP_0               (FCR_INTFLAGSET_FLTCAP_0_Val << FCR_INTFLAGSET_FLTCAP_Pos) /* (FCR_INTFLAGSET) No effect Position */
#define FCR_INTFLAGSET_FLTCAP_1               (FCR_INTFLAGSET_FLTCAP_1_Val << FCR_INTFLAGSET_FLTCAP_Pos) /* (FCR_INTFLAGSET) Set Interrupt Pending Position */
#define FCR_INTFLAGSET_Msk                    _UINT32_(0x00010301)                                 /* (FCR_INTFLAGSET) Register Mask  */


