zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcr.h
#define FCR_CRCPAUSE_PAUSE_Pos                _UINT32_(0)                                          /* (FCR_CRCPAUSE) CRC Pause Position */
#define FCR_CRCPAUSE_PAUSE_Msk                (_UINT32_(0x1) << FCR_CRCPAUSE_PAUSE_Pos)            /* (FCR_CRCPAUSE) CRC Pause Mask */
#define FCR_CRCPAUSE_PAUSE(value)             (FCR_CRCPAUSE_PAUSE_Msk & (_UINT32_(value) << FCR_CRCPAUSE_PAUSE_Pos)) /* Assignment of value for PAUSE in the FCR_CRCPAUSE register */
#define   FCR_CRCPAUSE_PAUSE_DISABLE_Val      _UINT32_(0x0)                                        /* (FCR_CRCPAUSE) CRC Reads Flash as Required  */
#define   FCR_CRCPAUSE_PAUSE_ENABLE_Val       _UINT32_(0x1)                                        /* (FCR_CRCPAUSE) Pause CRC Reads of Flash  */
#define FCR_CRCPAUSE_PAUSE_DISABLE            (FCR_CRCPAUSE_PAUSE_DISABLE_Val << FCR_CRCPAUSE_PAUSE_Pos) /* (FCR_CRCPAUSE) CRC Reads Flash as Required Position */
#define FCR_CRCPAUSE_PAUSE_ENABLE             (FCR_CRCPAUSE_PAUSE_ENABLE_Val << FCR_CRCPAUSE_PAUSE_Pos) /* (FCR_CRCPAUSE) Pause CRC Reads of Flash Position */
#define FCR_CRCPAUSE_Msk                      _UINT32_(0x00000001)                                 /* (FCR_CRCPAUSE) Register Mask  */


/* -------- FCR_CRCMADR : (FCR Offset: 0x30) (R/W 32) CRC Message Address REGISTER -------- */
#define FCR_CRCMADR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCMADR) CRC Message Address REGISTER  Reset Value */

#define FCR_CRCMADR_CRCMADR_Pos               _UINT32_(0)                                          /* (FCR_CRCMADR) Message Start Address in Flash Position */
#define FCR_CRCMADR_CRCMADR_Msk               (_UINT32_(0xFFFFFFF) << FCR_CRCMADR_CRCMADR_Pos)     /* (FCR_CRCMADR) Message Start Address in Flash Mask */
#define FCR_CRCMADR_CRCMADR(value)            (FCR_CRCMADR_CRCMADR_Msk & (_UINT32_(value) << FCR_CRCMADR_CRCMADR_Pos)) /* Assignment of value for CRCMADR in the FCR_CRCMADR register */
#define FCR_CRCMADR_Msk                       _UINT32_(0x0FFFFFFF)                                 /* (FCR_CRCMADR) Register Mask  */


/* -------- FCR_CRCMLEN : (FCR Offset: 0x34) (R/W 32) CRC Message Length REGISTER -------- */
#define FCR_CRCMLEN_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_CRCMLEN) CRC Message Length REGISTER  Reset Value */

#define FCR_CRCMLEN_CRCMLEN_Pos               _UINT32_(0)                                          /* (FCR_CRCMLEN) Message Length in Bytes Position */
#define FCR_CRCMLEN_CRCMLEN_Msk               (_UINT32_(0xFFFFF) << FCR_CRCMLEN_CRCMLEN_Pos)       /* (FCR_CRCMLEN) Message Length in Bytes Mask */
#define FCR_CRCMLEN_CRCMLEN(value)            (FCR_CRCMLEN_CRCMLEN_Msk & (_UINT32_(value) << FCR_CRCMLEN_CRCMLEN_Pos)) /* Assignment of value for CRCMLEN in the FCR_CRCMLEN register */
#define FCR_CRCMLEN_Msk                       _UINT32_(0x000FFFFF)                                 /* (FCR_CRCMLEN) Register Mask  */


/* -------- FCR_CRCIV : (FCR Offset: 0x38) (R/W 32) CRC Initial Value REGISTER -------- */
#define FCR_CRCIV_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCR_CRCIV) CRC Initial Value REGISTER  Reset Value */

#define FCR_CRCIV_CRCIV_Pos                   _UINT32_(0)                                          /* (FCR_CRCIV) CRC Initial Value Position */
#define FCR_CRCIV_CRCIV_Msk                   (_UINT32_(0xFFFFFFFF) << FCR_CRCIV_CRCIV_Pos)        /* (FCR_CRCIV) CRC Initial Value Mask */
#define FCR_CRCIV_CRCIV(value)                (FCR_CRCIV_CRCIV_Msk & (_UINT32_(value) << FCR_CRCIV_CRCIV_Pos)) /* Assignment of value for CRCIV in the FCR_CRCIV register */
#define FCR_CRCIV_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCIV) Register Mask  */


/* -------- FCR_CRCACC : (FCR Offset: 0x3C) ( R/ 32) CRC Accumulator REGISTER -------- */
#define FCR_CRCACC_RESETVALUE                 _UINT32_(0x00)                                       /*  (FCR_CRCACC) CRC Accumulator REGISTER  Reset Value */

#define FCR_CRCACC_CRCACC_Pos                 _UINT32_(0)                                          /* (FCR_CRCACC) CRC Accumulator Result Position */
#define FCR_CRCACC_CRCACC_Msk                 (_UINT32_(0xFFFFFFFF) << FCR_CRCACC_CRCACC_Pos)      /* (FCR_CRCACC) CRC Accumulator Result Mask */
#define FCR_CRCACC_CRCACC(value)              (FCR_CRCACC_CRCACC_Msk & (_UINT32_(value) << FCR_CRCACC_CRCACC_Pos)) /* Assignment of value for CRCACC in the FCR_CRCACC register */
#define FCR_CRCACC_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCACC) Register Mask  */


/* -------- FCR_CRCPOLY : (FCR Offset: 0x40) (R/W 32) CRC Polynomial REGISTER -------- */
#define FCR_CRCPOLY_RESETVALUE                _UINT32_(0x01)                                       /*  (FCR_CRCPOLY) CRC Polynomial REGISTER  Reset Value */

#define FCR_CRCPOLY_CRCPOLY_Pos               _UINT32_(0)                                          /* (FCR_CRCPOLY) CRC Polynomial Coefficients for LFSR Position */
#define FCR_CRCPOLY_CRCPOLY_Msk               (_UINT32_(0xFFFFFFFF) << FCR_CRCPOLY_CRCPOLY_Pos)    /* (FCR_CRCPOLY) CRC Polynomial Coefficients for LFSR Mask */
#define FCR_CRCPOLY_CRCPOLY(value)            (FCR_CRCPOLY_CRCPOLY_Msk & (_UINT32_(value) << FCR_CRCPOLY_CRCPOLY_Pos)) /* Assignment of value for CRCPOLY in the FCR_CRCPOLY register */
#define   FCR_CRCPOLY_CRCPOLY_0_Val           _UINT32_(0x0)                                        /* (FCR_CRCPOLY) Disable the XOR input to the shift register at the associated bit position  */
#define   FCR_CRCPOLY_CRCPOLY_1_Val           _UINT32_(0x1)                                        /* (FCR_CRCPOLY) Enable the XOR input to the shift register at the associated bit position  */
#define FCR_CRCPOLY_CRCPOLY_0                 (FCR_CRCPOLY_CRCPOLY_0_Val << FCR_CRCPOLY_CRCPOLY_Pos) /* (FCR_CRCPOLY) Disable the XOR input to the shift register at the associated bit position Position */
#define FCR_CRCPOLY_CRCPOLY_1                 (FCR_CRCPOLY_CRCPOLY_1_Val << FCR_CRCPOLY_CRCPOLY_Pos) /* (FCR_CRCPOLY) Enable the XOR input to the shift register at the associated bit position Position */
#define FCR_CRCPOLY_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (FCR_CRCPOLY) Register Mask  */


