zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcr.h
/* FCR register offsets definitions */
#define FCR_CTRLA_REG_OFST             _UINT32_(0x00)      /* (FCR_CTRLA) CTRL A REGISTER Offset */
#define FCR_CTRLB_REG_OFST             _UINT32_(0x04)      /* (FCR_CTRLB) CTRL B REGISTER Offset */
#define FCR_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (FCR_INTENCLR) Interrupt Enable Clear REGISTER Offset */
#define FCR_INTENSET_REG_OFST          _UINT32_(0x0C)      /* (FCR_INTENSET) Interrupt Enable SET REGISTER Offset */
#define FCR_INTFLAG_REG_OFST           _UINT32_(0x10)      /* (FCR_INTFLAG) Interrupt Flag REGISTER Offset */
#define FCR_INTFLAGSET_REG_OFST        _UINT32_(0x14)      /* (FCR_INTFLAGSET) Interrupt Flag Set REGISTER Offset */
#define FCR_STATUS_REG_OFST            _UINT32_(0x18)      /* (FCR_STATUS) Status REGISTER Offset */
#define FCR_DBGCTRL_REG_OFST           _UINT32_(0x1C)      /* (FCR_DBGCTRL) Debug Control CTRL REGISTER Offset */
#define FCR_ECCCTRL_REG_OFST           _UINT32_(0x20)      /* (FCR_ECCCTRL) ECC Control REGISTER Offset */
#define FCR_CRCCTRL_REG_OFST           _UINT32_(0x24)      /* (FCR_CRCCTRL) CRC Control REGISTER Offset */
#define FCR_CRCMODE_REG_OFST           _UINT32_(0x28)      /* (FCR_CRCMODE) CRC MODE REGISTER Offset */
#define FCR_CRCPAUSE_REG_OFST          _UINT32_(0x2C)      /* (FCR_CRCPAUSE) CRC Pause REGISTER Offset */
#define FCR_CRCMADR_REG_OFST           _UINT32_(0x30)      /* (FCR_CRCMADR) CRC Message Address REGISTER Offset */
#define FCR_CRCMLEN_REG_OFST           _UINT32_(0x34)      /* (FCR_CRCMLEN) CRC Message Length REGISTER Offset */
#define FCR_CRCIV_REG_OFST             _UINT32_(0x38)      /* (FCR_CRCIV) CRC Initial Value REGISTER Offset */
#define FCR_CRCACC_REG_OFST            _UINT32_(0x3C)      /* (FCR_CRCACC) CRC Accumulator REGISTER Offset */
#define FCR_CRCPOLY_REG_OFST           _UINT32_(0x40)      /* (FCR_CRCPOLY) CRC Polynomial REGISTER Offset */
#define FCR_CRCFXOR_REG_OFST           _UINT32_(0x44)      /* (FCR_CRCFXOR) CRC Final XOR REGISTER Offset */
#define FCR_CRCSUM_REG_OFST            _UINT32_(0x48)      /* (FCR_CRCSUM) CRC CheckSUM REGISTER Offset */
#define FCR_FFLTCTRL_REG_OFST          _UINT32_(0x4C)      /* (FCR_FFLTCTRL) Flash ECC Fault Control REGISTER Offset */
#define FCR_FFLTMODE_REG_OFST          _UINT32_(0x50)      /* (FCR_FFLTMODE) Flash ECC Fault Mode REGISTER Offset */
#define FCR_FFLTPTR_REG_OFST           _UINT32_(0x54)      /* (FCR_FFLTPTR) Flash ECC Fault Pointer REGISTER Offset */
#define FCR_FFLTADR_REG_OFST           _UINT32_(0x58)      /* (FCR_FFLTADR) Flash ECC Fault Address REGISTER Offset */
#define FCR_FFLTCAP_REG_OFST           _UINT32_(0x5C)      /* (FCR_FFLTCAP) Flash ECC Fault Capture Address REGISTER Offset */
#define FCR_FFLTPAR_REG_OFST           _UINT32_(0x60)      /* (FCR_FFLTPAR) Flash ECC Fault Parity REGISTER Offset */
#define FCR_FFLTSYN_REG_OFST           _UINT32_(0x64)      /* (FCR_FFLTSYN) Flash ECC Fault Syndrome REGISTER Offset */
#define FCR_CRP_REG_OFST               _UINT32_(0x68)      /* (FCR_CRP) CFM Page Read Protection REGISTER (CFM8) Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* FCR register API structure */
typedef struct
{  /* Polaris Flash Read Controller */
  __IO  uint32_t                       FCR_CTRLA;          /* Offset: 0x00 (R/W  32) CTRL A REGISTER */
  __IO  uint32_t                       FCR_CTRLB;          /* Offset: 0x04 (R/W  32) CTRL B REGISTER */
  __IO  uint32_t                       FCR_INTENCLR;       /* Offset: 0x08 (R/W  32) Interrupt Enable Clear REGISTER */
  __IO  uint32_t                       FCR_INTENSET;       /* Offset: 0x0C (R/W  32) Interrupt Enable SET REGISTER */
  __IO  uint32_t                       FCR_INTFLAG;        /* Offset: 0x10 (R/W  32) Interrupt Flag REGISTER */
  __IO  uint32_t                       FCR_INTFLAGSET;     /* Offset: 0x14 (R/W  32) Interrupt Flag Set REGISTER */
  __I   uint32_t                       FCR_STATUS;         /* Offset: 0x18 (R/   32) Status REGISTER */
  __IO  uint32_t                       FCR_DBGCTRL;        /* Offset: 0x1C (R/W  32) Debug Control CTRL REGISTER */
  __IO  uint32_t                       FCR_ECCCTRL;        /* Offset: 0x20 (R/W  32) ECC Control REGISTER */
  __IO  uint32_t                       FCR_CRCCTRL;        /* Offset: 0x24 (R/W  32) CRC Control REGISTER */
  __IO  uint32_t                       FCR_CRCMODE;        /* Offset: 0x28 (R/W  32) CRC MODE REGISTER */
  __IO  uint32_t                       FCR_CRCPAUSE;       /* Offset: 0x2C (R/W  32) CRC Pause REGISTER */
  __IO  uint32_t                       FCR_CRCMADR;        /* Offset: 0x30 (R/W  32) CRC Message Address REGISTER */
  __IO  uint32_t                       FCR_CRCMLEN;        /* Offset: 0x34 (R/W  32) CRC Message Length REGISTER */
  __IO  uint32_t                       FCR_CRCIV;          /* Offset: 0x38 (R/W  32) CRC Initial Value REGISTER */
  __I   uint32_t                       FCR_CRCACC;         /* Offset: 0x3C (R/   32) CRC Accumulator REGISTER */
  __IO  uint32_t                       FCR_CRCPOLY;        /* Offset: 0x40 (R/W  32) CRC Polynomial REGISTER */
  __IO  uint32_t                       FCR_CRCFXOR;        /* Offset: 0x44 (R/W  32) CRC Final XOR REGISTER */
  __IO  uint32_t                       FCR_CRCSUM;         /* Offset: 0x48 (R/W  32) CRC CheckSUM REGISTER */
  __IO  uint32_t                       FCR_FFLTCTRL;       /* Offset: 0x4C (R/W  32) Flash ECC Fault Control REGISTER */
  __IO  uint32_t                       FCR_FFLTMODE;       /* Offset: 0x50 (R/W  32) Flash ECC Fault Mode REGISTER */
  __IO  uint32_t                       FCR_FFLTPTR;        /* Offset: 0x54 (R/W  32) Flash ECC Fault Pointer REGISTER */
  __IO  uint32_t                       FCR_FFLTADR;        /* Offset: 0x58 (R/W  32) Flash ECC Fault Address REGISTER */
  __I   uint32_t                       FCR_FFLTCAP;        /* Offset: 0x5C (R/   32) Flash ECC Fault Capture Address REGISTER */
  __I   uint32_t                       FCR_FFLTPAR;        /* Offset: 0x60 (R/   32) Flash ECC Fault Parity REGISTER */
  __I   uint32_t                       FCR_FFLTSYN;        /* Offset: 0x64 (R/   32) Flash ECC Fault Syndrome REGISTER */
  __IO  uint32_t                       FCR_CRP;            /* Offset: 0x68 (R/W  32) CFM Page Read Protection REGISTER (CFM8) */
} fcr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_FCR_COMPONENT_H_ */
